pkg/wsman/wsmantesting/responses/cim/card/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Card"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000000E74</b:MessageID>
        <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Card</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:CIM_Card>
            <g:CanBeFRUed>true</g:CanBeFRUed>
            <g:CreationClassName>CIM_Card</g:CreationClassName>
            <g:ElementName>Managed System Base Board</g:ElementName>
            <g:Manufacturer>Intel Corporation</g:Manufacturer>
            <g:Model>NUC9V7QNB</g:Model>
            <g:OperationalStatus>0</g:OperationalStatus>
            <g:PackageType>9</g:PackageType>
            <g:SerialNumber>KNQN0221020W</g:SerialNumber>
            <g:Tag>CIM_Card</g:Tag>
            <g:Version>K47180-402</g:Version>
        </g:CIM_Card>
    </a:Body>
</a:Envelope>